Библиотека/src/Documents/ВыдачаКниг/ВыдачаКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаКниг</name>
  <basedOn>Task.ЗаказКниги</basedOn>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Enums/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Операция</name>
  <enumValues>
    <name>ПоступлениеКниг</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКнигиАбоненту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКнигиАбонентом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКниг</name>
  </enumValues>
</mdclass:Enum>

Библиотека/src/Documents/ВыдачаКниг/ObjectModule.bsl
// Проверим что бы был указан абонент
Функция ПроверитьШапкуДокумента(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Абонент)Тогда
		Сообщить("Не указано лицо которому выдана книга (абонент). Проведение отменено!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверим остатки книг перед списанием
Функция ПроверитьОстатки(Отказ)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(КнигиВБиблиотекеОстатки.КоличествоОстаток, 0) КАК КоличествоРегистр,
	|	ВложенныйЗапрос.Количество КАК КоличествоДокумент,
	|	ВложенныйЗапрос.Книга,
	|	ВложенныйЗапрос.НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыдачаКнигКниги.Книга КАК Книга,
	|		1 КАК Количество,
	|		ВыдачаКнигКниги.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.ВыдачаКниг.Книги КАК ВыдачаКнигКниги
	|	ГДЕ
	|		ВыдачаКнигКниги.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КнигиВБиблиотеке.Остатки(
	|				&ДатаКон,
	|				Книга В
	|						(ВЫБРАТЬ
	|							ВыдачаКнигКниги.Книга КАК Книга
	|						ИЗ
	|							Документ.ВыдачаКниг.Книги КАК ВыдачаКнигКниги
	|						ГДЕ
	|							ВыдачаКнигКниги.Ссылка = &Ссылка)
	|					И МестоРазмещения = ЗНАЧЕНИЕ(Справочник.МестаРазмещения.Библиотека)) КАК КнигиВБиблиотекеОстатки
	|		ПО (КнигиВБиблиотекеОстатки.Книга = ВложенныйЗапрос.Книга)";
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", ЭтотОбъект.Дата);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из РезультатЗапроса цикл
		Если Строка.КоличествоРегистр < Строка.КоличествоДокумент Тогда
			Сообщить("Недостаточно количества по позиции: "+ Строка.Книга+ " в строке: " + Строка.НомерСтроки + " Проведение отменено!", СтатусСообщения.Важное);		
			Отказ = Истина;
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьШапкуДокумента(Отказ);
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	ПроверитьОстатки(Отказ);
	
	Для Каждого ТекСтрокаКниги Из Книги Цикл
		// Регистр КнигиВБиблиотеке Приход
		// Сначала спишем
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;
		Движение.Количество = 1;
		// А теперь добавим
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Абонент;
		Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры

// Обработка заполнения от задачи ЗаказКниги
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		// Если заполняем документ из бизнес процесса заказа книг
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗаказКниги") Тогда
			Абонент = ДанныеЗаполнения.БизнесПроцесс.Автор.Абонент;	
			Книги.Загрузить(ДанныеЗаполнения.БизнесПроцесс.КнигиКЗаказу.Выгрузить());
			Дата = ТекущаяДата();
		// Если заполняем документ из массива ссылко на книги	
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
			Для каждого Книга из ДанныеЗаполнения цикл
				НоваяСтрока = Книги.Добавить();
				НоваяСтрока.Книга = Книга;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
